@mohammadkandy it fails  

# module.peering.azurerm_virtual_network_peering.apptohub must be replaced
-/+ resource "azurerm_virtual_network_peering" "apptohub" {
      ~ allow_forwarded_traffic      = false -> (known after apply)
      ~ allow_gateway_transit        = false -> (known after apply)
      ~ id                           = "/subscriptions/xxxxxxxxxxxxxxxxxxxxxxx/resourceGroups/xxx-rg-apps-pro-001/providers/Microsoft.Network/virtualNetworks/xxx-vnet-apps-pro-001/virtualNetworkPeerings/xxx-vnet-apps-pro-001-to-xxx-vnet-hub-pro-001" -> (known after apply)
        name                         = "xxx-vnet-apps-pro-001-to-xxx-vnet-hub-pro-001"
      ~ remote_virtual_network_id    = "/subscriptions/xxxxxxxxxxxxxxxxxx/resourceGroups/xxx-rg-hub-pro-001/providers/Microsoft.Network/virtualNetworks/xxx-vnet-hub-pro-001" -> (known after apply) # forces replacement
      ~ use_remote_gateways          = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.peering.azurerm_virtual_network_peering.hubtoapp must be replaced
-/+ resource "azurerm_virtual_network_peering" "hubtoapp" {
      ~ allow_forwarded_traffic      = false -> (known after apply)
      ~ allow_gateway_transit        = false -> (known after apply)
      ~ id                           = "/subscriptions/xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx/resourceGroups/xxx-rg-hub-pro-001/providers/Microsoft.Network/virtualNetworks/xxx-vnet-hub-pro-001/virtualNetworkPeerings/xxx-vnet-hub-pro-001-to-xxx-vnet-apps-pro-001" -> (known after apply)
        name                         = "xxx-vnet-hub-pro-001-to-xxx-vnet-apps-pro-001"
      ~ remote_virtual_network_id    = "/subscriptions/xxxxxxxxxxxxxxxxxxxxx/resourceGroups/xxx-rg-apps-pro-001/providers/Microsoft.Network/virtualNetworks/xxx-vnet-apps-pro-001" -> (known after apply) # forces replacement
      ~ use_remote_gateways          = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }